# GetOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPDFSettings..::..GetOptions Method
ExportPDFSettings Class See Also
---
Gets a copy of options from settings for exporting. Modification on this options would not change the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public PDFExportOptions GetOptions()
```

Visual Basic
---
```text
Public Function GetOptions As PDFExportOptions
```

Visual C++
---
```text
public:
PDFExportOptions^ GetOptions()
```

# ### Return Value
The options.
# Remarks
Since the [!:PDFExportOptions.FileName] is not serialized, when [!:Combine] is trueTruetruetrue (True in Visual Basic) (which means all the views would be exported into one PDF file, whose file name is specified by [!:PDFExportOptions.FileName]), the returned PDFExportOptions would have [!:PDFExportOptions.FileName] as an empty string. The user has to set the [!:PDFExportOptions.FileName] before calling the [!:Document.Export(string, IList{ElementId}, PDFExportOption)] API exporting a "combined" PDF file.
# See Also
ExportPDFSettings Class
Autodesk.Revit.DB Namespace